In [883]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

df kopyalamak çok önemli bunu data setini okuyunca hemen yap. İlerde orjinal data kesin lazım olacak

# Creating a New Column

In [884]:
data = {"isim": ["ali", "elif", "fatma", "mehmet"], "boy": [1.70, 1.55, 1.60, 1.90], "kilo": [70,55,60,80]}
df = pd.DataFrame(data)
df

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [885]:
df["vki"] = round((df["kilo"] / df["boy"] ** 2), 2)

In [886]:
df

     isim   boy  kilo    vki
0     ali  1.70    70  24.22
1    elif  1.55    55  22.89
2   fatma  1.60    60  23.44
3  mehmet  1.90    80  22.16

# Conditional Selection

In [887]:
df = pd.DataFrame(np.random.randn(5,4), index="a b c d e".split(), columns=["A", "B", "C", "D"])
df

          A         B         C         D
a -0.802514  0.178815  0.269182  1.830709
b -0.957708 -0.793049 -0.136051  0.874873
c -1.345656 -0.875418 -0.596377 -1.052231
d -0.334208 -0.425668  2.034510  1.157982
e -0.492239  0.104738 -1.063970  2.234957

In [888]:
df > 0

       A      B      C      D
a  False   True   True   True
b  False  False  False   True
c  False  False  False  False
d  False  False   True   True
e  False   True  False   True

In [889]:
df[df > 0]

    A         B         C         D
a NaN  0.178815  0.269182  1.830709
b NaN       NaN       NaN  0.874873
c NaN       NaN       NaN       NaN
d NaN       NaN  2.034510  1.157982
e NaN  0.104738       NaN  2.234957

In [890]:
df[df < 0]

          A         B         C         D
a -0.802514       NaN       NaN       NaN
b -0.957708 -0.793049 -0.136051       NaN
c -1.345656 -0.875418 -0.596377 -1.052231
d -0.334208 -0.425668       NaN       NaN
e -0.492239       NaN -1.063970       NaN

In [891]:
df[df["A"] < 0] # A da 0 dan küçükleri döndürdü diğerlerinin değeri önemli olmadı

          A         B         C         D
a -0.802514  0.178815  0.269182  1.830709
b -0.957708 -0.793049 -0.136051  0.874873
c -1.345656 -0.875418 -0.596377 -1.052231
d -0.334208 -0.425668  2.034510  1.157982
e -0.492239  0.104738 -1.063970  2.234957

In [892]:
df[df["A"] > 0][["C"]] # # A da 0 dan büyük olan satırların C değerlerini döndürdü

Empty DataFrame
Columns: [C]
Index: []

In [893]:
df

          A         B         C         D
a -0.802514  0.178815  0.269182  1.830709
b -0.957708 -0.793049 -0.136051  0.874873
c -1.345656 -0.875418 -0.596377 -1.052231
d -0.334208 -0.425668  2.034510  1.157982
e -0.492239  0.104738 -1.063970  2.234957

## &   -   and 
## |   -   or

In [894]:
df[(df["A"] > 0)  &  (df["B"] < 0)] # A da 0 dan büyük olacak ve B de 0 dan küçük olacak. ikisi aynı anda olmalı

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [895]:
df[(df["A"] > 0) | (df["B"] < 0)] # A da 0 büyük veya B de 0 dan küçük olanlar

          A         B         C         D
b -0.957708 -0.793049 -0.136051  0.874873
c -1.345656 -0.875418 -0.596377 -1.052231
d -0.334208 -0.425668  2.034510  1.157982

# Some Useful Methods with Titanic Dataset

In [896]:
import seaborn as sns

In [897]:
print(sns.get_dataset_names()) # seaborn'da gömülü dataframeler

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [898]:
df = sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## df.info()  & df.head() & df.tail() & df.sample()

In [899]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [900]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [901]:
df.head(5) # deafault ilk 5 satır

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [902]:
df.tail(5) # default olarak son 5 satır

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [903]:
df.sample(3) # rastgele 3 satır getirir

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
661,0,3,male,40.0,0,0,7.225,C,Third,man,True,NaN,Cherbourg,no,True
237,1,2,female,8.0,0,2,26.250,S,Second,child,False,NaN,Southampton,yes,False
504,1,1,female,16.0,0,0,86.500,S,First,woman,False,B,Southampton,yes,True

In [904]:
df.shape

(891, 15)

## df.describe()
Count: Her sütundaki non-null (null olmayan) değerlerin sayısını verir.

Mean: Ortalama (aritmetik ortalama) değeri verir.

Standard Deviation: Standart sapmayı verir, yani değerlerin ortalama etrafındaki yayılımını gösteren bir ölçüdür.

Minimum: En küçük değeri verir.

25th Percentile: Alt çeyrek yüzdeğini verir, yani değerlerin %25'lik kısmının altında kalan değeri verir.

Median (50th Percentile): Medyan değeri verir, yani değerlerin ortanca değerini verir.

75th Percentile: Üst çeyrek yüzdeğini verir, yani değerlerin %75'lik kısmının altında kalan değeri verir.

Maximum: En büyük değeri verir.

Unique: Benzersiz (farklı) değerlerin sayısını verir.

Top: En sık tekrar eden değeri verir.

Frequency: En sık tekrar eden değerin kaç kez tekrar ettiğini verir.

In [905]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [906]:
df.describe().transpose()

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [907]:
df.describe().T #transpose() kısaltma

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [908]:
df.describe(include="O").T # sadece object olanların ölçümlerini getirdi

            count unique          top freq
sex           891      2         male  577
embarked      889      3            S  644
who           891      3          man  537
embark_town   889      3  Southampton  644
alive         891      2           no  549

In [909]:
df.describe(include="all").T # bütün verileri getirdi

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
survived,891.0,NaN,NaN,NaN,0.383838,0.486592,0.0,0.0,0.0,1.0,1.0
pclass,891.0,NaN,NaN,NaN,2.308642,0.836071,1.0,2.0,3.0,3.0,3.0
sex,891,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,714.0,NaN,NaN,NaN,29.699118,14.526497,0.42,20.125,28.0,38.0,80.0
sibsp,891.0,NaN,NaN,NaN,0.523008,1.102743,0.0,0.0,0.0,1.0,8.0
parch,891.0,NaN,NaN,NaN,0.381594,0.806057,0.0,0.0,0.0,0.0,6.0
fare,891.0,NaN,NaN,NaN,32.204208,49.693429,0.0,7.9104,14.4542,31.0,512.3292
embarked,889,3,S,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN
class,891,3,Third,491,NaN,NaN,NaN,NaN,NaN,NaN,NaN
who,891,3,man,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN
adult_male,891,2,True,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN
deck,203,7,C,59,NaN,NaN,NaN,NaN,NaN,NaN,NaN
embark_town,889,3,Southampton,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN
alive,891,2,no,549,NaN,NaN,NaN,NaN,NaN,NaN,NaN
alone,891,2,True,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## df.corr()
"df.corr()" kodu, bir Pandas veri çerçevesinde bulunan sayısal sütunlar arasındaki Pearson korelasyon katsayılarını hesaplayan bir metoddur. Pearson korelasyonu, iki sürekli değişken arasındaki doğrusal ilişkiyi ölçen bir istatistiksel metriktir. Korelasyon katsayısı -1 ile 1 arasında bir değer alabilir ve iki değişken arasındaki ilişkinin yönünü (pozitif, negatif veya ilişkisiz) ve gücünü ifade eder.

"Df.corr()" kodu, veri çerçevesinde bulunan sayısal sütunlar arasındaki Pearson korelasyon katsayılarını bir korelasyon matrisi olarak döndürür. Korelasyon matrisi, veri çerçevesindeki her bir sayısal sütunun diğer sayısal sütunlarla olan korelasyonunu gösterir. Matrisin iki boyutlu yapısı, satır ve sütunlar arasındaki korelasyonu temsil eder. Matrisin çapraz köşeleri genellikle aynı sütunlar arasındaki korelasyonlar olup, diagonali ise sütunların kendi kendine korelasyonlarını içerir.

"Df.corr()" metodu, veri analitiği, keşifsel veri analitiği ve makine öğrenimi modellerinde değişkenler arasındaki ilişkileri değerlendirmek, çoklu değişken analizleri yapmak, özellik seçimi yapmak gibi birçok uygulamada kullanılabilir. Korelasyon katsayıları, değişkenler arasındaki ilişkileri anlamak ve modelleme süreçlerinde daha iyi kararlar vermek için değerli bir araçtır.

In [910]:
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [911]:
import warnings

warnings.filterwarnings("ignore") # bu tür uyarıları görmemek için

In [912]:
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

## .value_counts()
 bir sütundaki benzersiz değerlerin sayısını ve her bir değerin kaç kez tekrar ettiğini hesaplayan yada oranlarını görebiliriz

In [913]:
df.loc[:,"survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [914]:
df.survived.value_counts() # bü sütunda 0 ve 1 değerleri var ve kaç kere tekrar ettikleri

0    549
1    342
Name: survived, dtype: int64

In [915]:
df.survived.value_counts(normalize=True) # # bü sütunda 0 ve 1 değerleri var ve oranları

0    0.616162
1    0.383838
Name: survived, dtype: float64

## .unique() & .nunique()

In [916]:
df.embark_town.unique() # bü sütundaki unique değerleri gördük

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [917]:
df.survived.unique()

array([0, 1], dtype=int64)

In [918]:
df.embark_town.nunique() # bu sütundaki unique değerlerin sayısı

3

## .sort_values()

In [919]:
df.notnull().sum().sort_values(ascending=False)

survived       891
pclass         891
sex            891
sibsp          891
parch          891
fare           891
class          891
who            891
adult_male     891
alive          891
alone          891
embarked       889
embark_town    889
age            714
deck           203
dtype: int64

## .nsmallest() & .nlargest(()

## argmax() & argmin()

# drop()
drop() yöntemi, bir Pandas DataFrame'den belirtilen satır veya sütunu kaldırmak için kullanılır. 

Eğer sütun kaldırılacaksa, axis='columns' parametresi kullanılır ve belirtilen sütun kaldırılır. 

Benzer şekilde, eğer bir satır kaldırılacaksa, axis='index' parametresi kullanılır ve belirtilen satır kaldırılır.

Bu yöntem, DataFrame'den istenmeyen verileri kaldırmak ve veri manipülasyonu yapmak için sıkça kullanılır.

In [920]:
data = {"isim": ["ali", "elif", "fatma", "mehmet"], "boy": [1.70, 1.55, 1.60, 1.90], "kilo": [70,55,60,80]}
df = pd.DataFrame(data)
df["vki"] = round((df["kilo"] / df["boy"] ** 2), 2)

In [921]:
df

     isim   boy  kilo    vki
0     ali  1.70    70  24.22
1    elif  1.55    55  22.89
2   fatma  1.60    60  23.44
3  mehmet  1.90    80  22.16

In [922]:
df.drop("vki", axis=1) #kalıcı olarak düşmez

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [923]:
df.drop("vki", axis=1, inplace=True) #kalıcı olarak düştü
df

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [924]:
df.drop(3) # default axis = 0 dır

    isim   boy  kilo
0    ali  1.70    70
1   elif  1.55    55
2  fatma  1.60    60

# .loc[] & .iloc[]
loc: label-based

iloc: integer position-based

loc, "location"ın kısaltmasıdır ve satır ve sütun adlarına göre veriye erişmeyi sağlar.

loc, satır ve sütun etiketleri kullanarak belirli bir konumda bulunan veriye erişmek için kullanılır.

iloc, "integer location"ın kısaltmasıdır ve satır ve sütun numaralarına göre veriye erişmeyi sağlar.

iloc, satır ve sütun numaralarını kullanarak belirli bir konumda bulunan veriye erişmek için kullanılır.

1- Etiket veya dizin bağımsızlığı:Geleneksel indexleme yöntemleri, indekslerdeki değişikliklerden etkilenirken, "loc" ve "iloc" yöntemleri, konumlarına göre seçim yaparlar. Bu nedenle, veri setindeki indekslerdeki değişiklikler "loc" ve "iloc" yöntemleriyle yapılan seçimlerde bir sorun yaratmaz.

2-Hızlı performans: "iloc" fonksiyonu, sadece satır ve sütun dizinleri kullanarak veri seçimi yapar, bu nedenle loc fonksiyonuna göre daha hızlı çalışır. Bu özellik, büyük veri kümelerinde veya performans açısından kritik uygulamalarda faydalıdır.

3-Esneklik: Geleneksel indexleme yöntemleri, sadece sıfırdan başlayan, ardışık tam sayılar kullanarak indexlemeye izin verir. "loc" ve "iloc" yöntemleri ise etiket veya dizin değerlerine dayanır ve daha esnek bir seçim yapma imkanı sağlar. "loc" ve "iloc" fonksiyonları, veri çerçevesindeki satır ve sütunların bir arada kullanımına izin verir. Örneğin, belirli bir sütunda belirli bir satırdaki veriyi seçmek için hem satır hem de sütun etiketlerini veya dizinlerini kullanabilirsiniz. Bu esneklik, veri işleme işlemlerinde kullanışlıdır.

4-Daha okunaklı kod: "loc" ve "iloc" fonksiyonları, kodun daha okunaklı hale gelmesine yardımcı olur.

In [925]:
data = np.arange(20).reshape(5,4)

df = pd.DataFrame(data=data, columns=["col1", "col2", "col3", "col4"], index=range(1,6))

df

   col1  col2  col3  col4
1     0     1     2     3
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [926]:
df.loc[[1]] # label isimlerine göre getirir

   col1  col2  col3  col4
1     0     1     2     3

In [927]:
df.iloc[[0]] # index lere göre getirir

   col1  col2  col3  col4
1     0     1     2     3

In [928]:
df[["col1"]]

   col1
1     0
2     4
3     8
4    12
5    16

In [929]:
df.iloc[: , 0]

1     0
2     4
3     8
4    12
5    16
Name: col1, dtype: int32

In [930]:
df.loc[2:5]

   col1  col2  col3  col4
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [931]:
df.iloc[2:5]

   col1  col2  col3  col4
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [932]:
df.index = "a b c d e".split()   # ["a", "b", "c", "d", "e"]

In [933]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [934]:
df.loc["b": "d"]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [935]:
df.iloc[1:4]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [936]:
df.loc[["b"], ["col2"]]

   col2
b     5

In [937]:
df.iloc[[1], [1]]

   col2
b     5

In [938]:
df.loc["d": "e"]["col3"]

d    14
e    18
Name: col3, dtype: int32

In [939]:
df.loc["d": "e", ["col3"]]

   col3
d    14
e    18

In [940]:
df.loc[["a", "d", "e"], ["col3"]]

   col3
a     2
d    14
e    18

# reset_index()   &  set_index
reset_index(), DataFrame indeksini sıfırlar ve bunun yerine default hali kullanır.

set_index(), DataFrame'in belirtilen bir sütununu veya sütunlarını, DataFrame'in yeni bir indeksi olarak ayarlar.

In [941]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [942]:
df.reset_index() # kalıcı olmaz ve eski indeksleri saklar

  index  col1  col2  col3  col4
0     a     0     1     2     3
1     b     4     5     6     7
2     c     8     9    10    11
3     d    12    13    14    15
4     e    16    17    18    19

In [943]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [944]:
df.reset_index(drop=True, inplace=True) # eski indeksleri düşürdük ve bu işlemi kalıcı hale getirdik

In [945]:
df

   col1  col2  col3  col4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19

In [946]:
df.set_index("col1") # kalıcı olmaz

      col2  col3  col4
col1
0        1     2     3
4        5     6     7
8        9    10    11
12      13    14    15
16      17    18    19

In [947]:
df

   col1  col2  col3  col4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19

In [948]:
df.set_index("col1", inplace=True) # kalıcı hale geldi
df

      col2  col3  col4
col1
0        1     2     3
4        5     6     7
8        9    10    11
12      13    14    15
16      17    18    19

In [949]:
df.reset_index(inplace=True)
df

   col1  col2  col3  col4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19

In [950]:
df = df[["col2", "col3", "col1", "col4"]] # tekrar colum isimlerini sıralamak için böyle bir yöntem izledik
df

   col2  col3  col1  col4
0     1     2     0     3
1     5     6     4     7
2     9    10     8    11
3    13    14    12    15
4    17    18    16    19

# df.agg() & agg methods
aggregate() & agg(); bir sütuna veya sütunlara göre gruplandırılmış bir veri kümesinde farklı işlevlerin (örneğin, mean, sum, max) uygulanması için kullanılır.

[aggregate](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html),
[agg](https://pandas.pydata.org/pandas-docs/version/0.23/generated/pandas.core.groupby.DataFrameGroupBy.agg.html),
[SOURCE01](https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/),
[SOURCE02](https://www.analyticsvidhya.com/blog/2020/03/groupby-pandas-aggregating-data-python/)

Pandas'ın aggregation yöntemleri, belirli bir veri kümesi üzerinde işlemler gerçekleştirerek bir sonuç döndürür. 

Bu yöntemler, bir veri kümesindeki değerleri toplama, ortalama alma, en büyük veya en küçük değeri bulma gibi farklı işlemleri gerçekleştirir. 


Pandas'ın aggregation yöntemlerinden bazıları şunlardır:

**sum():** Belirtilen sütunda yer alan tüm değerlerin toplamını döndürür.

**mean():** Belirtilen sütunda yer alan tüm değerlerin ortalamasını döndürür.

**median():** Gruplanmış verilerin medyanını hesaplar.

**mode()** Belirtilen sütunda en çok tekrar eden değerleri döndürür.

**max():** Belirtilen sütunda yer alan en büyük değeri döndürür.

**min():** Belirtilen sütunda yer alan en küçük değeri döndürür.

**count():** Belirtilen sütunda yer alan toplam değer sayısını döndürür.

**std():** Belirtilen sütunda yer alan değerlerin standart sapmasını döndürür.

**var():** Belirtilen sütunda yer alan değerlerin varyansını döndürür.

**describe():** Gruplanmış verilerin istatistiksel özetini hesaplar.

**idxmin():** Belirtilen eksen boyunca minimum değeri içeren ilk indeksi döndürür.

**idxmax():** Belirtilen eksen boyunca maksimum değeri içeren ilk indeksi döndürür.

**corr():** Sütunlar  arasındaki korelasyonu, NA/null değerleri hariç tutarak hesaplar.

Bu yöntemler, bir DataFrame veya Series üzerinde kullanılabilir ve istenilen sütun veya satırlarda işlem yapılabilir. 

Pandas'ın aggregation yöntemleri, verileri hızlı ve etkili bir şekilde analiz etmek için çok kullanışlıdır.

[Pandas Official Documentation](https://pandas.pydata.org/docs/reference/frame.html)

In [951]:
dt = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Ece', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Sales':[180, 160, 150, 180, 240, 200, 220, 160]}

df = pd.DataFrame(dt)
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [952]:
df.agg([sum, min])

,Company,Department,Person,Age,Sales
sum,AmazonAmazonOpenAIOpenAIAmazonOpenAIAmazonOpenAI,ITHRITHRITHRHRIT,AhmetEceFatmaMehmetZeynepAliYusufElif,254,1490
min,Amazon,HR,Ahmet,25,150

In [953]:
df.loc[:, ["Age", "Sales"]].agg([sum]) # belirli sütunlara uyguladım

     Age  Sales
sum  254   1490

In [954]:
df.agg({"Age": sum, "Sales" : [min]}) # sütunlara ayrı ayrı işlemler atadık

       Age  Sales
sum  254.0    NaN
min    NaN  150.0

In [955]:
df.agg({"Age": [sum, np.mean], "Sales" : [min, max]})

         Age  Sales
sum   254.00    NaN
mean   31.75    NaN
min      NaN  150.0
max      NaN  240.0

In [956]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [957]:
df.Sales.min()

150

In [958]:
df.Sales.idxmax() # max Sales olanın indexisini döndürdü

4

In [959]:
df.Sales.idxmin() # min Sales olanın indexisini döndürdü

2

# .groupby()
groupby(); bir veri setindeki belirli bir sütuna göre gruplama yapmak için kullanılır ve aggregation metodlarıyla beraber kullanılır

Bu işlev, verileri gruplara ayırmak ve bu gruplar üzerinde çeşitli işlemler yapmak için kullanılır.

Örneğin, bir veri kümesinde müşterilerin isimleri, yaşları ve satın aldıkları ürünler yer alıyor olabilir. groupby() işlevi kullanarak, müşterilerin satın aldıkları ürüne göre gruplandırabilir ve her ürün için ortalama yaşlarını bulabilirsiniz.

[Source01](https://towardsdatascience.com/all-pandas-groupby-you-should-know-for-grouping-data-and-performing-operations-2a8ec1327b5),
[Source02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html),
[Source03](https://naomi-fridman.medium.com/pandas-groupby-explained-with-titanic-6a1c47eb8182)

In [960]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [961]:
df.groupby("Company") # bu şekilde object döndürür. bir işlem uygulamadık

In [962]:
df.groupby("Company").mean() # gruplayıp, grup ortalamalarına baktık. sadece numeric satırlara uyguladı

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [963]:
df.groupby("Company")[["Sales"]].mean() #sadece Sales sütununa uyguladık

         Sales
Company
Amazon   200.0
OpenAI   172.5

In [964]:
df.groupby("Company").count()

         Department  Person  Age  Sales
Company
Amazon            4       4    4      4
OpenAI            4       4    4      4

In [965]:
df.groupby("Company")[["Company"]].count()

         Company
Company
Amazon         4
OpenAI         4

In [966]:
df.Company.value_counts()

Amazon    4
OpenAI    4
Name: Company, dtype: int64

In [967]:
df.groupby(["Company", "Department"]).mean()

                     Age  Sales
Company Department
Amazon  HR          28.0  190.0
        IT          28.5  210.0
OpenAI  HR          39.0  190.0
        IT          31.5  155.0

In [968]:
# Bölümlere (departmanlara) göre toplam sales tutarlarını hesaplamak:

df.groupby('Department').sum()[['Sales']]

            Sales
Department
HR            760
IT            730

In [969]:
compare = df.groupby(["Company"]) # bir değişkene atayabiliriz

In [970]:
compare.mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [971]:
compare.corr()

                    Age     Sales
Company
Amazon  Age    1.000000 -0.221032
        Sales -0.221032  1.000000
OpenAI  Age    1.000000  0.593934
        Sales  0.593934  1.000000

# filter()
filter(): Verileri belirli bir koşula göre filtreler.

belirli bir koşulu karşılayan satırları veya sütunları seçmek için kullanılabilir.

Parametreler: df.filter(items=None, like=None, regex=None, axis=None)

items: Bir liste veya dizin nesnesi olarak belirtilen sütun adlarını içeren bir liste. Sadece bu sütunlar seçilir.

like: String olarak belirtilen bir deseni içeren sütun adları seçilir.

regex: Regex (düzenli ifade) olarak belirtilen bir deseni içeren sütun adları seçilir.

axis: 'columns' veya 1 olarak belirtilirse sütunlarda filtreleme yapar, 'index' veya 0 olarak belirtilirse satırlarda filtreleme yapar.

[Pandas Official Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.filter.html),
[SOURCE01](https://www.sharpsightlabs.com/blog/pandas-filter/),
[SOURCE02](https://appdividend.com/2020/03/19/pandas-filter-pandas-dataframe-filter-in-python-example/)

In [972]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [973]:
df.filter(['Company', 'Age'])

  Company  Age
0  Amazon   32
1  Amazon   26
2  OpenAI   35
3  OpenAI   40
4  Amazon   25
5  OpenAI   38
6  Amazon   30
7  OpenAI   28

In [974]:
df.filter(like='a') # sütun adlarından "a" kelimesini içeren sütunlar seçilecektir.

  Company Department  Sales
0  Amazon         IT    180
1  Amazon         HR    160
2  OpenAI         IT    150
3  OpenAI         HR    180
4  Amazon         IT    240
5  OpenAI         HR    200
6  Amazon         HR    220
7  OpenAI         IT    160

In [975]:
df.filter(regex='^C') # Bu örnekte sütun adlarından "C" harfi ile başlayan sütunlar seçilecektir.

  Company
0  Amazon
1  Amazon
2  OpenAI
3  OpenAI
4  Amazon
5  OpenAI
6  Amazon
7  OpenAI

In [976]:
df.filter(like="3", axis=0)

  Company Department  Person  Age  Sales
3  OpenAI         HR  Mehmet   40    180

## groupby - filter

In [977]:
df.groupby("Company").mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [978]:
df.groupby("Company").filter(lambda x : x["Age"].mean() < 30) 
# grup yaş ortalaması 30 un altında ise True olur ve o değerler döner

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
4  Amazon         IT  Zeynep   25    240
6  Amazon         HR   Yusuf   30    220

In [979]:
(lambda x : x["Age"].mean() < 30)(df.groupby("Company"))

Company
Amazon     True
OpenAI    False
Name: Age, dtype: bool

# transform()

DataFrame veya Series nesnelerinde gruplama işlemleri sonrası verileri dönüştürmek için kullanılan bir fonksiyondur. "transform()" fonksiyonu, her bir grup için aynı boyutta bir sonuç üretir ve orijinal veri yapısını korur. Gruplanmış veri üzerinde herhangi bir işlem yapabilir ve sonuçları orijinal veri yapısına uygun bir şekilde dönüştürebilir.

transform(), bir pandas DataFrame ya da Serisi'ndeki verileri değiştirmek veya dönüştürmek için kullanılan bir yöntemdir. 

Belirtilen işlevi uygular ve sonucu yeni bir Seri veya DataFrame olarak döndürür.

Özellikle gruplama işlemleri ile birlikte kullanıldığında oldukça yararlıdır.

agg. metodlarla kullanılabilir

[SOUREC01](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.transform.html) & [SOURCE02](https://www.analyticsvidhya.com/blog/2020/03/understanding-transform-function-python/)

In [980]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [981]:
df_num = df.iloc[:, 3:]

In [982]:
df_num

   Age  Sales
0   32    180
1   26    160
2   35    150
3   40    180
4   25    240
5   38    200
6   30    220
7   28    160

In [983]:
df_num.Sales.transform(np.sqrt)

0    13.416408
1    12.649111
2    12.247449
3    13.416408
4    15.491933
5    14.142136
6    14.832397
7    12.649111
Name: Sales, dtype: float64

In [984]:
df_num.Sales.agg(np.sqrt)

0    13.416408
1    12.649111
2    12.247449
3    13.416408
4    15.491933
5    14.142136
6    14.832397
7    12.649111
Name: Sales, dtype: float64

## groupby - transform

In [985]:
df.groupby("Company")["Age"].mean()

Company
Amazon    28.25
OpenAI    35.25
Name: Age, dtype: float64

In [986]:
df.groupby("Company")[["Age"]].transform(np.mean) # her satıra grubunun ortalamasını yazdı

     Age
0  28.25
1  28.25
2  35.25
3  35.25
4  28.25
5  35.25
6  28.25
7  35.25

# apply() - applymap() - map()

apply(): DataFrame veya Seri üzerinde bir satır veya sütun boyunca bir işlem yapmak için kullanılır.

applymap(): DataFrame'in tamamı üzerinde öğe bazında işlem için kullanılır.her hücreye teker teker uygular

map(): Yalnızca Seri lerde kullanılabilir ve Seri nin her bir elemanına uygulanacak bir işlem için kullanılır.

[apply](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)
[applymap](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.applymap.html)
[map](https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html)

[SOUREC01](https://www.geeksforgeeks.org/python-pandas-apply/), 
[SOURCE02](https://www.datacamp.com/community/tutorials/pandas-apply),
[SOURCE03](https://sparkbyexamples.com/pandas/pandas-apply-function-usage-examples/),
[SOURCE04](https://realpython.com/python-map-function/#:~:text=Python's%20map()%20is%20a,them%20into%20a%20new%20iterable.),
[SOURCE05](https://www.w3resource.com/pandas/series/series-map.php),
[SOURCE06](https://towardsdatascience.com/introduction-to-pandas-apply-applymap-and-map-5d3e044e93ff#:~:text=apply()%20is%20used%20to,a%20Series%20with%20another%20value.),
[SOURCE07](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas) &
[SOURCE08](https://medium.com/@akaivdo/how-to-use-map-apply-applymap-methods-in-pandas-ddde5f2140bd)

In [987]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [988]:
df[["Company", "Person"]].applymap(lambda x: x.upper()) # bütun satırlara tek tek işlem yaptı

  Company  Person
0  AMAZON   AHMET
1  AMAZON     ECE
2  OPENAI   FATMA
3  OPENAI  MEHMET
4  AMAZON  ZEYNEP
5  OPENAI     ALI
6  AMAZON   YUSUF
7  OPENAI    ELIF

In [989]:
df["Company"].map(lambda x: x.upper()) # map sadece Serieslerle çalışır.

0    AMAZON
1    AMAZON
2    OPENAI
3    OPENAI
4    AMAZON
5    OPENAI
6    AMAZON
7    OPENAI
Name: Company, dtype: object

In [990]:
df.Age.map(lambda x: x + 10) # bütün yaşlara 10 ekledi

0    42
1    36
2    45
3    50
4    35
5    48
6    40
7    38
Name: Age, dtype: int64

In [991]:
data = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Ece', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Sales':[180, 160, 150, 180, 240, 200, 220, 160]}

df = pd.DataFrame(data)
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [992]:
df_num = df.iloc[:, 3:]
df_num

   Age  Sales
0   32    180
1   26    160
2   35    150
3   40    180
4   25    240
5   38    200
6   30    220
7   28    160

In [993]:
df_num.applymap(lambda x: x * 10)

   Age  Sales
0  320   1800
1  260   1600
2  350   1500
3  400   1800
4  250   2400
5  380   2000
6  300   2200
7  280   1600

In [994]:
df_num.transform(lambda x: x * 10)

   Age  Sales
0  320   1800
1  260   1600
2  350   1500
3  400   1800
4  250   2400
5  380   2000
6  300   2200
7  280   1600

In [995]:
df_num.Age.map(lambda x: x * 10)

0    320
1    260
2    350
3    400
4    250
5    380
6    300
7    280
Name: Age, dtype: int64

In [996]:
df_num.Age.apply(lambda x: x * 10)

0    320
1    260
2    350
3    400
4    250
5    380
6    300
7    280
Name: Age, dtype: int64

In [997]:
df_num.apply(lambda x: x * 10)

   Age  Sales
0  320   1800
1  260   1600
2  350   1500
3  400   1800
4  250   2400
5  380   2000
6  300   2200
7  280   1600

In [998]:
df.groupby("Company")["Age"].transform("mean")

0    28.25
1    28.25
2    35.25
3    35.25
4    28.25
5    35.25
6    28.25
7    35.25
Name: Age, dtype: float64

In [999]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [1000]:
df.applymap(lambda x: len(str(x)))

   Company  Department  Person  Age  Sales
0        6           2       5    2      3
1        6           2       3    2      3
2        6           2       5    2      3
3        6           2       6    2      3
4        6           2       6    2      3
5        6           2       3    2      3
6        6           2       5    2      3
7        6           2       4    2      3

In [1001]:
df.apply(lambda x: len(str(x)))

Company       124
Department     95
Person        123
Age            87
Sales          97
dtype: int64

In [1002]:
df.Company.map(lambda x: len(str(x)))

0    6
1    6
2    6
3    6
4    6
5    6
6    6
7    6
Name: Company, dtype: int64

In [1003]:
df_num.applymap(np.sum) # hiç birşey değişmedi çünkü her elemana tek tek uyguladı

   Age  Sales
0   32    180
1   26    160
2   35    150
3   40    180
4   25    240
5   38    200
6   30    220
7   28    160

In [1004]:
df_num.apply(np.sum) # sütun bazında çalıştığı için. age lerin toplamanı verdi

Age       254
Sales    1490
dtype: int64

## apply - transform farkı

In [1005]:
df_num.apply(np.sum, axis=1) # satıları topladık. mantıklı değil ama kullanılabiliyor

0    212
1    186
2    185
3    220
4    265
5    238
6    250
7    188
dtype: int64

In [1006]:
df.groupby("Company").transform(np.mean)

     Age  Sales
0  28.25  200.0
1  28.25  200.0
2  35.25  172.5
3  35.25  172.5
4  28.25  200.0
5  35.25  172.5
6  28.25  200.0
7  35.25  172.5

In [1007]:
df.groupby("Company").apply(np.mean)

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [1008]:
df.Person

0     Ahmet
1       Ece
2     Fatma
3    Mehmet
4    Zeynep
5       Ali
6     Yusuf
7      Elif
Name: Person, dtype: object

In [1009]:
df.Person.map({"Ahmet": "A", "Ece": "E"})

0      A
1      E
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
Name: Person, dtype: object

In [1010]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [1011]:
df.Department.map({"IT": 0, "HR": 1})

0    0
1    1
2    0
3    1
4    0
5    1
6    1
7    0
Name: Department, dtype: int64

In [1012]:
df.Department = df.Department.map({"IT": 0, "HR": 1})
df

  Company  Department  Person  Age  Sales
0  Amazon           0   Ahmet   32    180
1  Amazon           1     Ece   26    160
2  OpenAI           0   Fatma   35    150
3  OpenAI           1  Mehmet   40    180
4  Amazon           0  Zeynep   25    240
5  OpenAI           1     Ali   38    200
6  Amazon           1   Yusuf   30    220
7  OpenAI           0    Elif   28    160

# .pivot() & .pivot_table()
pivot() fonksiyonu, bir DataFrame üzerinde tek bir indeks ve tek bir sütunu kullanarak veri dönüşümü yapar. İlk parametre olarak kullanılan DataFrame'i belirtir ve ardından index, columns ve values parametrelerini kullanarak pivot tablosunun nasıl oluşturulacağını belirleyebiliriz. pivot() fonksiyonu, herhangi bir hesaplama yapmadan sadece verileri yeniden düzenler.

pivot_table() fonksiyonu ise bir DataFrame üzerinde gruplama ve dönüşüm işlemleri yapar. pivot_table() fonksiyonu, daha karmaşık işlemler yapmamıza olanak tanır ve özellikle toplama, ortalama, medyan, maksimum, minimum gibi istatistiksel hesaplamaları yapabiliriz. pivot_table() fonksiyonu, aggfunc parametresi ile hangi hesaplamanın yapılacağını belirleyebiliriz.

Her iki fonksiyon da, veriyi yeniden düzenleyerek farklı bir görünüm elde etmeyi sağlar. Yani, mevcut veriyi farklı bir düzenleme şekli ile sunar.

pivot_table() fonksiyonu, birden fazla indeks ve sütunu desteklerken, pivot() fonksiyonu yalnızca tek bir indeks ve sütunu kullanabilir.

pivot_table() fonksiyonu, eksik değerleri doldurma, çoklu değerlere sahip hücrelerde agregasyon yapma gibi daha gelişmiş dönüşüm ve manipülasyon seçenekleri sunar.

Her iki fonksiyon da, genellikle veri analitiği, raporlama ve veri görselleştirme süreçlerinde kullanılır ve veri setlerini farklı bakış açılarından incelemek için kullanılabilir.

pivot() ve pivot_table() fonksiyonları, pandas kütüphanesindeki güçlü veri dönüşüm ve analiz araçlarından sadece birkaçıdır ve veri manipülasyonunda oldukça kullanışlıdırlar.

In [1013]:
data = {'gender':['male', 'female', 'female', 'male', 'female', 'male'],
        'sport':['tennis', 'tennis', 'basketball', 'football', 'voleyball', 'basketball'],
        'status':["professional","professional","professional","amateur","amateur","amateur"],
        'age':[20, 24, 26, 23, 22, 21],
        'height':[185, 172, 175, 178, 182, 196],
        'weight':[83, 58, 62, 80, 65, 90]}

df = pd.DataFrame(data)

df

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female  basketball  professional   26     175      62
3    male    football       amateur   23     178      80
4  female   voleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [1014]:
df.pivot_table(index="gender", columns="sport", values=["age"], aggfunc="mean") # mean default tur

              age
sport  basketball football tennis voleyball
gender
female       26.0      NaN   24.0      22.0
male         21.0     23.0   20.0       NaN

In [1015]:
df.pivot_table(index="gender", columns="sport", values=["age", "weight", "height"])

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0      175.0      NaN  172.0
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0       62.0      NaN   58.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [1016]:
df.pivot(index="gender", columns="sport", values=["age", "weight", "height"]) # deplicate olmadığı için aynı şeyi verdi

              age                               weight                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0       62.0      NaN   58.0
male         21.0     23.0   20.0       NaN       90.0     80.0   83.0

                     height
sport  voleyball basketball football tennis voleyball
gender
female      65.0      175.0      NaN  172.0     182.0
male         NaN      196.0    178.0  185.0       NaN

In [1017]:
df

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female  basketball  professional   26     175      62
3    male    football       amateur   23     178      80
4  female   voleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [1018]:
df.pivot_table(index= "gender", columns="sport", values= "status") 
# default aggfunc="mean" olduğu için str lere çalışamaz

Empty DataFrame
Columns: []
Index: [female, male]

In [1019]:
df.pivot(index="gender", columns="sport", values="status")
# duplicate olmadığı için. str lerle çalışırken bunu tercih edebiliriz

sport     basketball football        tennis voleyball
gender
female  professional      NaN  professional   amateur
male         amateur  amateur  professional       NaN

In [1020]:
df.loc[2, "sport"] = "tennis"
df

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female      tennis  professional   26     175      62
3    male    football       amateur   23     178      80
4  female   voleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [1021]:
df.pivot_table(index="gender", columns="sport", values=["age", "weight", "height"])

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female        NaN      NaN   25.0      22.0        NaN      NaN  173.5
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0        NaN      NaN   60.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [1022]:
# df.pivot(index="gender", columns="sport", values=["age", "weight", "height"]) 
# duplicate veriler olduğu için çalışmadı

# Nan Values

NaN = Not-a-Number

np.nan, belirsiz veya tanımlanamaz sayısal değerleri temsil etmek için kullanılır.

np.nan değeri, "sentinel" bir değer olarak kabul edilir ve herhangi bir değerle, hatta kendisiyle bile karşılaştırılamaz.

Sentinel; matematiksel hesaplamalarda belirsiz veya tanımlanamaz değerleri temsil etmek için kullanılır. 

None; sentinel bir değerdir ve bir fonksiyonun veya metodun "boş" veya "tanımsız" bir değeri ifade etmesi için kullanılır. 

Sütunun data tipi object ise "nan", sayısal ise "NaN" olur.

[SOURCE01](https://www.educative.io/edpresso/what-is-the-none-keyword-in-python), 
[SOURCE02](https://stackoverflow.com/questions/21095654/what-is-a-nonetype-object),
[SOURCE03](https://www.skytowner.com/explore/difference_between_none_and_nan_in_pandas), 
[SOURCE04](https://kegui.medium.com/what-is-the-difference-between-nan-none-pd-nan-and-np-nan-a8ee0532e2eb),
[SOURCE05](https://stackoverflow.com/questions/53436339/difference-between-np-nan-and-np-nan),
[SOURCE06](https://stackoverflow.com/questions/40309789/difference-between-nan-and-nan-in-python),
[SOURCE07](https://towardsdatascience.com/navigating-the-hell-of-nans-in-python-71b12558895b)

In [1023]:
id_no = ["P001", "P002", "P003", "P004", "P005", "P006", "P007", "P008", "P009", "P010", "P011"]
gender = ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F", "M"]
status = ["FT", "PT", "-", "FT", "PT", "PT", "FT", "-", "PT", "FT", np.nan]
dept = ["DS", "FS", "AWS", "AWS", "DS", None, "FS", "FS", np.nan, "DS", "AWS"]
V1 = np.array([2, 3, 5, np.nan, 7, 1, np.nan, 10, 14, "-", 6])
V2 = np.array([8, np.nan, 5, 8, 11, np.nan, np.nan, 2, 3, 7, 9])
salary = np.array([np.nan, 54, 59, 120, 58, 75, None, 136, 60, 125, np.nan])

df0 = pd.DataFrame({
                   "id" : id_no,
                   "gender": gender,
                   "status": status,
                   "dept": dept,
                   "var1" : V1,
                   "var2" : V2,
                   "salary" : salary
                  })
df = df0.copy() # original veriyi korumuş olduk
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [1024]:
type(df.iloc[0, 4]) # var1 sütunundaki nan yazan hücreler str'dir
# eğer dataframede NaN şeklinde yazılı değilse str' dir

str

In [1025]:
type(df.iloc[3, 4])

str

In [1026]:
type(df.iloc[5, 5])

numpy.float64

In [1027]:
df.info() # var1 de str değer olduğu için nan ları göremedi

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  10 non-null     object
 3   dept    9 non-null      object
 4   var1    11 non-null     object
 5   var2    8 non-null      float64
 6   salary  8 non-null      object
dtypes: float64(1), object(6)
memory usage: 744.0+ bytes

In [1028]:
type(np.nan)

float

In [1029]:
type(np.NaN)

float

In [1030]:
type(None)

NoneType

In [1031]:
a = pd.Series([1, np.nan, np.NaN, None, 2])
print(a)
a.isnull().sum()

0    1.0
1    NaN
2    NaN
3    NaN
4    2.0
dtype: float64

3

In [1032]:
b = pd.Series([1, "nan", "nan", 3, 2, "-"])
print(b)
b.isnull().sum()

0      1
1    nan
2    nan
3      3
4      2
5      -
dtype: object

0

In [1033]:
print("1", 0 * np.NaN)
print("2", np.nan - np.nan)
print("3", np.nan + np.nan)
print("4", np.nan - 10)
print("5", np.nan + 10)
print("6", np.nan == np.nan) 
print("7", 10 > np.nan)
print("8", np.inf > np.nan) #np.inf sonsuz demek
print("9", float('-inf') < np.nan < float('inf'))
print("10", np.nan is np.nan)

1 nan
2 nan
3 nan
4 nan
5 nan
6 False
7 False
8 False
9 False
10 True

In [1034]:
pd.DataFrame([[np.nan, 1], [np.NaN, 2]])

    0  1
0 NaN  1
1 NaN  2

In [1035]:
np.array([[np.nan, 1], [np.nan, 2]])

array([[nan,  1.],
       [nan,  2.]])

## .isnull() & .isna() & .notnull()

In [1036]:
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [1037]:
df.isnull()

       id  gender  status   dept   var1   var2  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False  False  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False  False   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [1038]:
df.isna()

       id  gender  status   dept   var1   var2  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False  False  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False  False   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [1039]:
df.notnull()

      id  gender  status   dept  var1   var2  salary
0   True    True    True   True  True   True   False
1   True    True    True   True  True  False    True
2   True    True    True   True  True   True    True
3   True    True    True   True  True   True    True
4   True    True    True   True  True   True    True
5   True    True    True  False  True  False    True
6   True    True    True   True  True  False   False
7   True    True    True   True  True   True    True
8   True    True    True  False  True   True    True
9   True    True    True   True  True   True    True
10  True    True   False   True  True   True   False

In [1040]:
df.isnull().any() # sütun sütun baktı ve null var mı diye sordu

id        False
gender    False
status     True
dept       True
var1      False
var2       True
salary     True
dtype: bool

In [1041]:
df.isnull().any(axis=1) # satır satır baktı ve null var mı diye sordu

0      True
1      True
2     False
3     False
4     False
5      True
6      True
7     False
8      True
9     False
10     True
dtype: bool

In [1042]:
df[df.isnull().any(axis=1)]

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
8   P009      M     PT   NaN   14   3.0     60
10  P011      M    NaN   AWS    6   9.0    NaN

In [1043]:
df.isnull().sum() # sütunlarda kaç adet null var ?

id        0
gender    0
status    1
dept      2
var1      0
var2      3
salary    3
dtype: int64

In [1044]:
df.isnull().sum().sum() #  bütün veride kaç adet null var ?

9

##  Converting Improper Values to NaN Values

In [1062]:
df[["var1"]]

   var1
0     2
1     3
2     5
3   nan
4     7
5     1
6   nan
7    10
8    14
9     -
10    6

In [1063]:
df[["var1"]].isnull()

     var1
0   False
1   False
2   False
3   False
4   False
5   False
6   False
7   False
8   False
9   False
10  False

In [1064]:
df

      id gender status  dept var1  var2 salary
0   P001      M     FT    DS    2   8.0    NaN
1   P002      F     PT    FS    3   NaN     54
2   P003      M      -   AWS    5   5.0     59
3   P004      F     FT   AWS  nan   8.0    120
4   P005      M     PT    DS    7  11.0     58
5   P006      F     PT  None    1   NaN     75
6   P007      M     FT    FS  nan   NaN   None
7   P008      F      -    FS   10   2.0    136
8   P009      M     PT   NaN   14   3.0     60
9   P010      F     FT    DS    -   7.0    125
10  P011      M    NaN   AWS    6   9.0    NaN

In [1047]:
df["var1"].replace("-", np.nan) # sütun hala object type'inde

0       2
1       3
2       5
3     nan
4       7
5       1
6     nan
7      10
8      14
9     NaN
10      6
Name: var1, dtype: object

In [1048]:
df["var1"].replace("-", np.nan).astype(float) # burada amaç str "nan" larıda kolayca gerçek NaN çevirmek

0      2.0
1      3.0
2      5.0
3      NaN
4      7.0
5      1.0
6      NaN
7     10.0
8     14.0
9      NaN
10     6.0
Name: var1, dtype: float64

In [456]:
df["var1"].replace("-", np.nan)

0      2.0
1      3.0
2      5.0
3      NaN
4      7.0
5      1.0
6      NaN
7     10.0
8     14.0
9      NaN
10     6.0
Name: var1, dtype: float64

In [876]:
df["var1"] = df["var1"].replace("-", np.nan).astype(float)

In [877]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M      -   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F      -    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [459]:
df["status"].replace("-", np.nan)

0      FT
1      PT
2     NaN
3      FT
4      PT
5      PT
6      FT
7     NaN
8      PT
9      FT
10    NaN
Name: status, dtype: object

In [460]:
df["status"] = df["status"].replace("-", np.nan)

In [461]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [462]:
df0.isnull().sum().sum()

9

In [463]:
df.isnull().sum().sum()

14

# .dropna() & .drop()

In [464]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [465]:
df.dropna() # bir tane bile null varsa o satırı düşürdü

     id gender status dept  var1  var2 salary
4  P005      M     PT   DS   7.0  11.0     58

In [466]:
df.dropna(how="any") # default , bir tane bile null varsa düşür

     id gender status dept  var1  var2 salary
4  P005      M     PT   DS   7.0  11.0     58

In [467]:
df.dropna(how="all") # default , bir tane bile dolu varsa düşürme

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [468]:
df.dropna(axis= 1) # bir tane bile null varsa o sütunu düşürdü

      id gender
0   P001      M
1   P002      F
2   P003      M
3   P004      F
4   P005      M
5   P006      F
6   P007      M
7   P008      F
8   P009      M
9   P010      F
10  P011      M

In [469]:
df.dropna(thresh=6) # null olmayanlar 6 ve fazlaysa düşürme

     id gender status dept  var1  var2 salary
0  P001      M     FT   DS   2.0   8.0    NaN
1  P002      F     PT   FS   3.0   NaN     54
2  P003      M    NaN  AWS   5.0   5.0     59
3  P004      F     FT  AWS   NaN   8.0    120
4  P005      M     PT   DS   7.0  11.0     58
7  P008      F    NaN   FS  10.0   2.0    136
8  P009      M     PT  NaN  14.0   3.0     60
9  P010      F     FT   DS   NaN   7.0    125

In [470]:
df.drop([1, 3, 5]) # index label'ina göre düşürdü

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
2   P003      M    NaN  AWS   5.0   5.0     59
4   P005      M     PT   DS   7.0  11.0     58
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F    NaN   FS  10.0   2.0    136
8   P009      M     PT  NaN  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [471]:
df.drop(["var1", "var2"], axis=1)

      id gender status  dept salary
0   P001      M     FT    DS    NaN
1   P002      F     PT    FS     54
2   P003      M    NaN   AWS     59
3   P004      F     FT   AWS    120
4   P005      M     PT    DS     58
5   P006      F     PT  None     75
6   P007      M     FT    FS   None
7   P008      F    NaN    FS    136
8   P009      M     PT   NaN     60
9   P010      F     FT    DS    125
10  P011      M    NaN   AWS    NaN

# .fillna()

In [472]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [473]:
df.fillna(0) # bütün nulları 0 ile doldurdu

      id gender status dept  var1  var2  salary
0   P001      M     FT   DS   2.0   8.0       0
1   P002      F     PT   FS   3.0   0.0      54
2   P003      M      0  AWS   5.0   5.0      59
3   P004      F     FT  AWS   0.0   8.0     120
4   P005      M     PT   DS   7.0  11.0      58
5   P006      F     PT    0   1.0   0.0      75
6   P007      M     FT   FS   0.0   0.0       0
7   P008      F      0   FS  10.0   2.0     136
8   P009      M     PT    0  14.0   3.0      60
9   P010      F     FT   DS   0.0   7.0     125
10  P011      M      0  AWS   6.0   9.0       0

In [474]:
df[["var1"]].fillna(0)

    var1
0    2.0
1    3.0
2    5.0
3    0.0
4    7.0
5    1.0
6    0.0
7   10.0
8   14.0
9    0.0
10   6.0

In [475]:
df[["var1"]].fillna(df["var1"].mean()) # boş hücreleri o sütunun ortalamasıyla doldurduk

    var1
0    2.0
1    3.0
2    5.0
3    6.0
4    7.0
5    1.0
6    6.0
7   10.0
8   14.0
9    6.0
10   6.0

In [476]:
df.fillna(df.mean())

      id gender status  dept  var1    var2   salary
0   P001      M     FT    DS   2.0   8.000   85.875
1   P002      F     PT    FS   3.0   6.625   54.000
2   P003      M    NaN   AWS   5.0   5.000   59.000
3   P004      F     FT   AWS   6.0   8.000  120.000
4   P005      M     PT    DS   7.0  11.000   58.000
5   P006      F     PT  None   1.0   6.625   75.000
6   P007      M     FT    FS   6.0   6.625   85.875
7   P008      F    NaN    FS  10.0   2.000  136.000
8   P009      M     PT   NaN  14.0   3.000   60.000
9   P010      F     FT    DS   6.0   7.000  125.000
10  P011      M    NaN   AWS   6.0   9.000   85.875

In [477]:
df

      id gender status  dept  var1  var2 salary
0   P001      M     FT    DS   2.0   8.0    NaN
1   P002      F     PT    FS   3.0   NaN     54
2   P003      M    NaN   AWS   5.0   5.0     59
3   P004      F     FT   AWS   NaN   8.0    120
4   P005      M     PT    DS   7.0  11.0     58
5   P006      F     PT  None   1.0   NaN     75
6   P007      M     FT    FS   NaN   NaN   None
7   P008      F    NaN    FS  10.0   2.0    136
8   P009      M     PT   NaN  14.0   3.0     60
9   P010      F     FT    DS   NaN   7.0    125
10  P011      M    NaN   AWS   6.0   9.0    NaN

In [478]:
df.fillna({"dept": "Other", "var1": df.var1.mean(), "var2": df.var2.median()}) 
#sözlük yapısıyla istediğimiz sütunlara istediğimi işlemleri ayrı ayrı yaptırabildik

      id gender status   dept  var1  var2 salary
0   P001      M     FT     DS   2.0   8.0    NaN
1   P002      F     PT     FS   3.0   7.5     54
2   P003      M    NaN    AWS   5.0   5.0     59
3   P004      F     FT    AWS   6.0   8.0    120
4   P005      M     PT     DS   7.0  11.0     58
5   P006      F     PT  Other   1.0   7.5     75
6   P007      M     FT     FS   6.0   7.5   None
7   P008      F    NaN     FS  10.0   2.0    136
8   P009      M     PT  Other  14.0   3.0     60
9   P010      F     FT     DS   6.0   7.0    125
10  P011      M    NaN    AWS   6.0   9.0    NaN

In [479]:
df.dept.mode() # en çok tekrar eden eleman

0    AWS
1     DS
2     FS
Name: dept, dtype: object

In [480]:
df.dept.fillna(df.dept.mode()[0])
# 0 yazdık çünkü birden fazla mode olduğu için ilkini aldık

0      DS
1      FS
2     AWS
3     AWS
4      DS
5     AWS
6      FS
7      FS
8     AWS
9      DS
10    AWS
Name: dept, dtype: object

## bfill, dfill

In [481]:
df.dept

0       DS
1       FS
2      AWS
3      AWS
4       DS
5     None
6       FS
7       FS
8      NaN
9       DS
10     AWS
Name: dept, dtype: object

In [482]:
df.dept.fillna(method="bfill") #sonraki gelen deeğerle doldur

0      DS
1      FS
2     AWS
3     AWS
4      DS
5      FS
6      FS
7      FS
8      DS
9      DS
10    AWS
Name: dept, dtype: object

In [483]:
df.dept.fillna(method="ffill") #önceki gelen değerle doldur

0      DS
1      FS
2     AWS
3     AWS
4      DS
5      DS
6      FS
7      FS
8      FS
9      DS
10    AWS
Name: dept, dtype: object

In [484]:
df.dept.fillna(method="ffill", inplace=True)
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M    NaN  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F    NaN   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [485]:
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M    NaN  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F    NaN   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [486]:
df.loc[df["salary"] >= 100, "status"]

3     FT
7    NaN
9     FT
Name: status, dtype: object

In [487]:
df.loc[df["salary"] < 100, "status"]

1     PT
2    NaN
4     PT
5     PT
8     PT
Name: status, dtype: object

In [488]:
df.loc[df["salary"] >= 100, "status"].fillna(df.loc[df["salary"] >= 100, "status"].mode()[0])

3    FT
7    FT
9    FT
Name: status, dtype: object

In [489]:
df.loc[df["salary"] >= 100, "status"] = df.loc[df["salary"] >= 100, "status"].fillna(df.loc[df["salary"] >= 100, "status"].mode()[0])

df.loc[df["salary"] < 100, "status"] = df.loc[df["salary"] < 100, "status"].fillna(df.loc[df["salary"] < 100, "status"].mode()[0])

In [490]:
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M     PT  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F     FT   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M    NaN  AWS   6.0   9.0    NaN

In [491]:
df.groupby(["gender", "dept"])["status"].transform(lambda x: x.mode()[0])
# burada gender ve dept göre gruplayıp bu grubların status'unu grupların status değerlerinin mode larına eşitledik
#yani tüm grupların elemanları aynı statuse sahip oldu

0     FT
1     FT
2     PT
3     FT
4     FT
5     FT
6     FT
7     FT
8     FT
9     FT
10    PT
Name: status, dtype: object

In [492]:
df["status"].fillna(df.groupby(["gender", "dept"])["status"].transform(lambda x: x.mode()[0]), inplace=True)
df

      id gender status dept  var1  var2 salary
0   P001      M     FT   DS   2.0   8.0    NaN
1   P002      F     PT   FS   3.0   NaN     54
2   P003      M     PT  AWS   5.0   5.0     59
3   P004      F     FT  AWS   NaN   8.0    120
4   P005      M     PT   DS   7.0  11.0     58
5   P006      F     PT   DS   1.0   NaN     75
6   P007      M     FT   FS   NaN   NaN   None
7   P008      F     FT   FS  10.0   2.0    136
8   P009      M     PT   FS  14.0   3.0     60
9   P010      F     FT   DS   NaN   7.0    125
10  P011      M     PT  AWS   6.0   9.0    NaN

In [493]:
df["salary"].fillna(df.groupby(["status", "dept"])["salary"].transform("mean"), inplace=True)
df

      id gender status dept  var1  var2  salary
0   P001      M     FT   DS   2.0   8.0   125.0
1   P002      F     PT   FS   3.0   NaN    54.0
2   P003      M     PT  AWS   5.0   5.0    59.0
3   P004      F     FT  AWS   NaN   8.0   120.0
4   P005      M     PT   DS   7.0  11.0    58.0
5   P006      F     PT   DS   1.0   NaN    75.0
6   P007      M     FT   FS   NaN   NaN   136.0
7   P008      F     FT   FS  10.0   2.0   136.0
8   P009      M     PT   FS  14.0   3.0    60.0
9   P010      F     FT   DS   NaN   7.0   125.0
10  P011      M     PT  AWS   6.0   9.0    59.0

In [494]:
df["var1"].fillna(df.groupby(["gender", "status"])["var1"].transform("mean"), inplace=True)
df

      id gender status dept  var1  var2  salary
0   P001      M     FT   DS   2.0   8.0   125.0
1   P002      F     PT   FS   3.0   NaN    54.0
2   P003      M     PT  AWS   5.0   5.0    59.0
3   P004      F     FT  AWS  10.0   8.0   120.0
4   P005      M     PT   DS   7.0  11.0    58.0
5   P006      F     PT   DS   1.0   NaN    75.0
6   P007      M     FT   FS   2.0   NaN   136.0
7   P008      F     FT   FS  10.0   2.0   136.0
8   P009      M     PT   FS  14.0   3.0    60.0
9   P010      F     FT   DS  10.0   7.0   125.0
10  P011      M     PT  AWS   6.0   9.0    59.0

In [495]:
df["var2"].fillna(df.groupby(["status"])["var2"].transform("mean"), inplace=True)
df

      id gender status dept  var1   var2  salary
0   P001      M     FT   DS   2.0   8.00   125.0
1   P002      F     PT   FS   3.0   7.00    54.0
2   P003      M     PT  AWS   5.0   5.00    59.0
3   P004      F     FT  AWS  10.0   8.00   120.0
4   P005      M     PT   DS   7.0  11.00    58.0
5   P006      F     PT   DS   1.0   7.00    75.0
6   P007      M     FT   FS   2.0   6.25   136.0
7   P008      F     FT   FS  10.0   2.00   136.0
8   P009      M     PT   FS  14.0   3.00    60.0
9   P010      F     FT   DS  10.0   7.00   125.0
10  P011      M     PT  AWS   6.0   9.00    59.0

# append() & concat() & merge() & join()

**Difference between merge, join, and concatenate;**

[Source01](https://realpython.com/pandas-merge-join-and-concat/), 
[Source02](https://studymachinelearning.com/difference-between-merge-join-and-concatenate/abs), 
[Source03](https://www.educba.com/pandas-merge-vs-join/),
[Source04](https://pandas.pydata.org/docs/user_guide/merging.html), 
[Source05](https://stackoverflow.com/questions/38256104/differences-between-merge-and-concat-in-pandas)

**append() ve concat()** ile dikey birleştirme yapabiliriz.

**concat(), join() ve merge()** ile yatay birleştirme yapabiliriz.

**append() ve concat()** ile aynı anda iki veya ikiden fazla dataframe i birleştirebiliriz.

**append() ve concat()** da ortak sütun olması gerekmez.

**concat()** ile hem satır hem de sütun bazlı birleştirme yapabiliriz. Yani "axis" sadece concat() de var.

**join()** de aynı anda iki veya daha fazla dataframe i birleştirebiliriz ancak aynı sütun isimleri varsa en fazla iki df birleştirebiliriz.

**merge()** ile aynı anda iki dataframe i birleştirebiliriz.

**merge()** ile birleştirme işlemimizi ortak sütun üzerinden yapıyoruz.

In [496]:
one = pd.DataFrame({
   'name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

two = pd.DataFrame({
   'name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])

In [497]:
one

     name subject_id  marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78

In [498]:
two

    name subject_id  marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

## append()

sadece dikey birleştirme yapabiliriz.

aynı anda iki veya ikiden fazla dataframe i birleştirebiliriz.

ortak sütun olması gerekmez. ortak sütunları tanır

In [201]:
one.append(two)

     name subject_id  marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [202]:
one.append(two, ignore_index=True)

     name subject_id  marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

## concat()

hem satır hem de sütun bazlı birleştirme yapabiliriz. Yani "axis" sadece concat() de var.

aynı anda iki veya ikiden fazla dataframe i birleştirebiliriz.

ortak sütun olması gerekmez. ortak sütunları tanır

In [203]:
one

     name subject_id  marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78

In [204]:
two

    name subject_id  marks_scored
1  Billy       sub2            89
2  Brian       sub4            80
3   Bran       sub3            79
4  Bryce       sub6            97
5  Betty       sub5            88

In [205]:
pd.concat([one, two]) # default axis = 0

     name subject_id  marks_scored
1    Alex       sub1            98
2     Amy       sub2            90
3   Allen       sub4            87
4   Alice       sub6            69
5  Ayoung       sub5            78
1   Billy       sub2            89
2   Brian       sub4            80
3    Bran       sub3            79
4   Bryce       sub6            97
5   Betty       sub5            88

In [206]:
pd.concat([one, two], ignore_index=True)

     name subject_id  marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

In [207]:
pd.concat([one, two], ignore_index=True, axis=1)

        0     1   2      3     4   5
1    Alex  sub1  98  Billy  sub2  89
2     Amy  sub2  90  Brian  sub4  80
3   Allen  sub4  87   Bran  sub3  79
4   Alice  sub6  69  Bryce  sub6  97
5  Ayoung  sub5  78  Betty  sub5  88

In [208]:
pd.concat([one.iloc[ : , :2 ], two.iloc[ : , 1: ]])

     name subject_id  marks_scored
1    Alex       sub1           NaN
2     Amy       sub2           NaN
3   Allen       sub4           NaN
4   Alice       sub6           NaN
5  Ayoung       sub5           NaN
1     NaN       sub2          89.0
2     NaN       sub4          80.0
3     NaN       sub3          79.0
4     NaN       sub6          97.0
5     NaN       sub5          88.0

## merge() 

yatay birleştirme yapabiliriz.

ortak sütun olmalı. yoksa sütun eşitlemesi yapmamız gerekir

tek seferde iki dataframe i birleştirebiliriz.

birleştirme işlemimizi ortak sütun üzerinden yapıyoruz.

In [209]:
x = pd.DataFrame({'key': ['K0', 'K1', 'K2'],
                     'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']})

y = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [210]:
x

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2

In [211]:
y

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [212]:
pd.merge(x, y) #   how="inner" default değer
# on="key" default çünkü key ikisinde de var. otomatik anladı

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [213]:
pd.merge(x, y, how="outer")

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3  NaN  NaN  C3  D3

In [214]:
pd.merge(x, y, how="left")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2

In [215]:
pd.merge(x, y, how="right")

  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K1   A1   B1  C1  D1
2  K2   A2   B2  C2  D2
3  K3  NaN  NaN  C3  D3

In [216]:
df1 = pd.DataFrame({'lkey': ['x', 'y', 'z', 'x'],
                    'lvalue': [2, 3, 5, 7]})

df2 = pd.DataFrame({'rkey': ['a', 'x', 'z', 'b'],
                    'rvalue': [7, 8, 9, 10]})

In [217]:
df1

  lkey  lvalue
0    x       2
1    y       3
2    z       5
3    x       7

In [218]:
df2

  rkey  rvalue
0    a       7
1    x       8
2    z       9
3    b      10

In [219]:
pd.merge(df1, df2, left_on="lkey", right_on="rkey")
# ortak sütun olmadığı için ikisinin ortak olmasını istediğimiz sütunları tek tek tanımlamamız gerekir

  lkey  lvalue rkey  rvalue
0    x       2    x       8
1    x       7    x       8
2    z       5    z       9

In [220]:
pd.merge(df1, df2, left_on="lkey", right_on="rkey", how="outer")

  lkey  lvalue rkey  rvalue
0    x     2.0    x     8.0
1    x     7.0    x     8.0
2    y     3.0  NaN     NaN
3    z     5.0    z     9.0
4  NaN     NaN    a     7.0
5  NaN     NaN    b    10.0

## join()

 yatay birleştirme yapabiliriz. Ortak sütun zorunluluğu yok

**join()** de aynı anda iki veya daha fazla dataframe i birleştirebiliriz ancak aynı sütun isimleri varsa en fazla iki df birleştirebiliriz.

Daha çok SQL tabanlı veri işleme işlemlerinde kullanılır. 

[Source 01](https://sparkbyexamples.com/pandas/pandas-join-explained-with-examples/), 
[Source 02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.join.html), 
[Source 03](https://www.w3schools.com/python/pandas/ref_df_join.asp)

In [221]:
df3 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index = ['K0', 'K1', 'K2']) 

df4 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index = ['K0', 'K2', 'K3'])

In [222]:
df3

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [223]:
df4

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [224]:
df3.join(df4) # default how="left" . 3 teki satırları getirdi, 4teki ortak satırları getirdi

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [225]:
df3.join(df4, how="right")

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [226]:
df3.join(df4, how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [227]:
df3.join(df4, how="inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [228]:
df4.join(df3)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [229]:
df5 = pd.DataFrame({'key': ['K0', 'K2', 'K3', 'K4', 'K5', 'K6'],
                   'X': ['X0', 'X2', 'X3', 'X4', 'X5', 'X6']})

df6 = pd.DataFrame({'key': ['K0', 'K2', 'K3'],
                      'Y': ['Y0', 'Y2', 'Y3']})

In [230]:
df5

  key   X
0  K0  X0
1  K2  X2
2  K3  X3
3  K4  X4
4  K5  X5
5  K6  X6

In [231]:
df6

  key   Y
0  K0  Y0
1  K2  Y2
2  K3  Y3

In [232]:
#df5.join(df6) # aynı isimli sütun olduğu için çalışmaz

In [233]:
df5.join(df6, lsuffix="_5", rsuffix="_6") # bu şekilde aynı sütun isimlerini farklılaştırdık

  key_5   X key_6    Y
0    K0  X0    K0   Y0
1    K2  X2    K2   Y2
2    K3  X3    K3   Y3
3    K4  X4   NaN  NaN
4    K5  X5   NaN  NaN
5    K6  X6   NaN  NaN

In [234]:
df5.set_index("key")

      X
key
K0   X0
K2   X2
K3   X3
K4   X4
K5   X5
K6   X6

In [235]:
df6.set_index("key")

      Y
key
K0   Y0
K2   Y2
K3   Y3

In [236]:
df5.set_index("key").join(df6.set_index("key"))

      X    Y
key
K0   X0   Y0
K2   X2   Y2
K3   X3   Y3
K4   X4  NaN
K5   X5  NaN
K6   X6  NaN

# String methods
**str.lower():** Bir stringi küçük harfe dönüştürür

**str.upper():** Bir stringi büyük harfe dönüştürür

**str.capitalize():** İlk karakteri büyük harfe dönüştürür

**str.title():** Her kelimenin ilk karakterini büyük harfe dönüştürür

**str.swapcase():** Büyük harfleri küçük, küçük harfleri büyük harfe dönüştürür

**str.isalpha():** Tüm karakterlerin alfabede yer alıp almadığını kontrol ederek True veya False değeri döndürür

**str.isnumeric():** Tüm karakterlerin sayısal değer içerip içermediğini kontrol ederek True veya False değeri döndürür

**str.isalnum():** Tüm karakterlerin harf veya sayısal değer içerip içermediğini kontrol ederek True veya False değeri döndürür

**str.endswith():** Bir stringin belirtilen değerle bittiğini kontrol ederek True veya False değeri döndürür

**str.startswith():** Bir stringin belirtilen değerle başladığını kontrol ederek True veya False değeri döndürür

**str.contains():** Bir alt dizinin bir dizede bulunup bulunmadığını kontrol ederek her bir öğe için True veya False değeri döndürür

**str.strip():** Bir stringin başındaki ve sonundaki boşlukları temizler ve kırpılmış bir versiyonunu döndürür

**str.replace():** Belirtilen bir değeri başka bir değerle değiştirilmiş bir string döndürür

**str.split():** Bir stringi belirtilen ayraçta böler ve bir liste döndürür

**str.find():** Bir stringde belirtilen bir değeri arar ve bulunduğu konumun indeksini döndürür

**str.findall():** Bir desendeki tüm örneklerin bir listesini döndürür

**str.join():** Bir iterable ın öğelerini bir stringe dönüştürür

[SOURCE01](https://docs.python.org/3/library/stdtypes.html#string-methods),
[SOURCE02](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html),
[SOURCE03](https://www.aboutdatablog.com/post/10-most-useful-string-functions-in-pandas),
[SOURCE04](https://www.tutorialspoint.com/python_pandas/python_pandas_working_with_text_data.htm) &
[Video](https://www.youtube.com/watch?v=6JNwK6hEneg)

In [237]:
df = pd.DataFrame(data=[['Tyler DURDEN', 'HR', "manager", "$180,000", 55],
                        ['MARIA puder', "IT", "data analyst", "150000dolar", 28],
                        ['dorothy gale', "HR", "recruiter", "$120,000", 30],
                        ['Edmond Dantes', "IT", "data scientist", "$170,000","-"], 
                        ['Gregor SAMSA',"IT", "frontend developer", "120000dolar",32]],
                  columns=["name","dept", "job", "sales", "age"])
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [238]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   dept    5 non-null      object
 2   job     5 non-null      object
 3   sales   5 non-null      object
 4   age     5 non-null      object
dtypes: object(5)
memory usage: 328.0+ bytes

In [239]:
df.name.str.title()

0     Tyler Durden
1      Maria Puder
2     Dorothy Gale
3    Edmond Dantes
4     Gregor Samsa
Name: name, dtype: object

In [240]:
df.name.str.capitalize()

0     Tyler durden
1      Maria puder
2     Dorothy gale
3    Edmond dantes
4     Gregor samsa
Name: name, dtype: object

In [241]:
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [242]:
df.job.str.isalpha()

0     True
1    False
2     True
3    False
4    False
Name: job, dtype: bool

In [243]:
df.dept.str.isalpha()

0    True
1    True
2    True
3    True
4    True
Name: dept, dtype: bool

In [244]:
df.age.str.isnumeric()

0      NaN
1      NaN
2      NaN
3    False
4      NaN
Name: age, dtype: object

In [245]:
df.age.astype(str).str.isnumeric()

0     True
1     True
2     True
3    False
4     True
Name: age, dtype: bool

In [246]:
df

            name dept                 job        sales age
0   Tyler DURDEN   HR             manager     $180,000  55
1    MARIA puder   IT        data analyst  150000dolar  28
2   dorothy gale   HR           recruiter     $120,000  30
3  Edmond Dantes   IT      data scientist     $170,000   -
4   Gregor SAMSA   IT  frontend developer  120000dolar  32

In [247]:
df.job.str.contains("data")

0    False
1     True
2    False
3     True
4    False
Name: job, dtype: bool

In [248]:
df[df.job.str.contains("data")]

            name dept             job        sales age
1    MARIA puder   IT    data analyst  150000dolar  28
3  Edmond Dantes   IT  data scientist     $170,000   -

In [249]:
df.sales

0       $180,000
1    150000dolar
2       $120,000
3       $170,000
4    120000dolar
Name: sales, dtype: object

In [250]:
df.sales.str.rstrip("dolar").str.lstrip("$")

0    180,000
1     150000
2    120,000
3    170,000
4     120000
Name: sales, dtype: object

In [251]:
df.sales.str.strip("dolar$").str.replace(",", "").astype(float)

0    180000.0
1    150000.0
2    120000.0
3    170000.0
4    120000.0
Name: sales, dtype: float64

In [252]:
df.sales = df.sales.str.strip("dolar$").str.replace(",", "").astype(float)

In [253]:
df

            name dept                 job     sales age
0   Tyler DURDEN   HR             manager  180000.0  55
1    MARIA puder   IT        data analyst  150000.0  28
2   dorothy gale   HR           recruiter  120000.0  30
3  Edmond Dantes   IT      data scientist  170000.0   -
4   Gregor SAMSA   IT  frontend developer  120000.0  32

In [254]:
df.age.replace("-", np.nan)

0    55.0
1    28.0
2    30.0
3     NaN
4    32.0
Name: age, dtype: float64

In [255]:
df.age = df.age.replace("-", np.nan)

In [256]:
df

            name dept                 job     sales   age
0   Tyler DURDEN   HR             manager  180000.0  55.0
1    MARIA puder   IT        data analyst  150000.0  28.0
2   dorothy gale   HR           recruiter  120000.0  30.0
3  Edmond Dantes   IT      data scientist  170000.0   NaN
4   Gregor SAMSA   IT  frontend developer  120000.0  32.0

In [257]:
df.name.str.title().str.split(" ").str[0]

0      Tyler
1      Maria
2    Dorothy
3     Edmond
4     Gregor
Name: name, dtype: object

In [258]:
df.name.str.title().str.split(" ").str[1]

0    Durden
1     Puder
2      Gale
3    Dantes
4     Samsa
Name: name, dtype: object

In [259]:
df["first_name"] = df.name.str.title().str.split(" ").str[0]

In [260]:
df["last_name"] = df.name.str.title().str.split(" ").str[1]

In [261]:
df

            name dept                 job     sales   age first_name last_name
0   Tyler DURDEN   HR             manager  180000.0  55.0      Tyler    Durden
1    MARIA puder   IT        data analyst  150000.0  28.0      Maria     Puder
2   dorothy gale   HR           recruiter  120000.0  30.0    Dorothy      Gale
3  Edmond Dantes   IT      data scientist  170000.0   NaN     Edmond    Dantes
4   Gregor SAMSA   IT  frontend developer  120000.0  32.0     Gregor     Samsa

In [262]:
df.drop("name", inplace=True, axis=1)

In [263]:
df = df[["first_name", "last_name", "dept", "job", "sales", "age"]]
df

  first_name last_name dept                 job     sales   age
0      Tyler    Durden   HR             manager  180000.0  55.0
1      Maria     Puder   IT        data analyst  150000.0  28.0
2    Dorothy      Gale   HR           recruiter  120000.0  30.0
3     Edmond    Dantes   IT      data scientist  170000.0   NaN
4     Gregor     Samsa   IT  frontend developer  120000.0  32.0

In [264]:
df.job.str.find("scient") # -1 yok demek, hangi indexte başlıyorsa onu döndürdü

0   -1
1   -1
2   -1
3    5
4   -1
Name: job, dtype: int64

In [265]:
df.job.str.findall("d")

0        []
1       [d]
2        []
3       [d]
4    [d, d]
Name: job, dtype: object

In [266]:
df.job.str.findall("d").apply(len)

0    0
1    1
2    0
3    1
4    2
Name: job, dtype: int64

In [267]:
df.job.str.findall("d").map(len)

0    0
1    1
2    0
3    1
4    2
Name: job, dtype: int64

In [268]:
df["skills"] = [[], ["Python", "Tableau", "SQL"], [], ["ML", "DL", "NLP"], ["React", "Django"]]
df["Skills"] = [[], "Python, Tableau, SQL", [], ["ML", "DL", "NLP"], ["React", "Django"]]
df

,first_name,last_name,dept,job,sales,age,skills,Skills
0,Tyler,Durden,HR,manager,180000.0,55.0,[],[]
1,Maria,Puder,IT,data analyst,150000.0,28.0,"[Python, Tableau, SQL]","Python, Tableau, SQL"
2,Dorothy,Gale,HR,recruiter,120000.0,30.0,[],[]
3,Edmond,Dantes,IT,data scientist,170000.0,NaN,"[ML, DL, NLP]","[ML, DL, NLP]"
4,Gregor,Samsa,IT,frontend developer,120000.0,32.0,"[React, Django]","[React, Django]"

In [269]:
df.skills.str.join(",")

0
1    Python,Tableau,SQL
2
3             ML,DL,NLP
4          React,Django
Name: skills, dtype: object

In [270]:
df.Skills.str.join(",")

0
1    P,y,t,h,o,n,,, ,T,a,b,l,e,a,u,,, ,S,Q,L
2
3                                  ML,DL,NLP
4                               React,Django
Name: Skills, dtype: object

In [271]:
df.Skills.apply(lambda x: ",".join(x) if type(x) == list else x)

0
1    Python, Tableau, SQL
2
3               ML,DL,NLP
4            React,Django
Name: Skills, dtype: object

In [272]:
df.Skills = df.Skills.apply(lambda x: ",".join(x) if type(x) == list else x)
df

,first_name,last_name,dept,job,sales,age,skills,Skills
0,Tyler,Durden,HR,manager,180000.0,55.0,[],
1,Maria,Puder,IT,data analyst,150000.0,28.0,"[Python, Tableau, SQL]","Python, Tableau, SQL"
2,Dorothy,Gale,HR,recruiter,120000.0,30.0,[],
3,Edmond,Dantes,IT,data scientist,170000.0,NaN,"[ML, DL, NLP]","ML,DL,NLP"
4,Gregor,Samsa,IT,frontend developer,120000.0,32.0,"[React, Django]","React,Django"

# pd.get_dummies

get_dummies(), makine öğrenimi ve veri analizinde yaygın olarak kullanılan bir işlevdir. 

Genellikle kategorik değişkenleri veya text datalarını, makine öğrenimi algoritmaları tarafından kolayca işlenebilen sayısal veya binary dönüştürmek için kullanılır.

[SOURCE01](https://www.sharpsightlabs.com/blog/pandas-get-dummies/),
[SOURCE02](https://dataindependent.com/pandas/pandas-get-dummies-pd-get_dummies/),
[SOURCE03](https://www.educative.io/answers/what-is-the-getdummies-function-in-pandas),
[SOURCE04](https://www.w3resource.com/pandas/get_dummies.php)

In [273]:
df

,first_name,last_name,dept,job,sales,age,skills,Skills
0,Tyler,Durden,HR,manager,180000.0,55.0,[],
1,Maria,Puder,IT,data analyst,150000.0,28.0,"[Python, Tableau, SQL]","Python, Tableau, SQL"
2,Dorothy,Gale,HR,recruiter,120000.0,30.0,[],
3,Edmond,Dantes,IT,data scientist,170000.0,NaN,"[ML, DL, NLP]","ML,DL,NLP"
4,Gregor,Samsa,IT,frontend developer,120000.0,32.0,"[React, Django]","React,Django"

In [274]:
pd.get_dummies(df.dept)

   HR  IT
0   1   0
1   0   1
2   1   0
3   0   1
4   0   1

In [275]:
pd.get_dummies(df.dept, drop_first=True) # ilk sütunu düşürdü

   IT
0   0
1   1
2   0
3   1
4   1

In [276]:
df.Skills.str.get_dummies(sep=",")

    SQL   Tableau  DL  Django  ML  NLP  Python  React
0     0         0   0       0   0    0       0      0
1     1         1   0       0   0    0       1      0
2     0         0   0       0   0    0       0      0
3     0         0   1       0   1    1       0      0
4     0         0   0       1   0    0       0      1

In [277]:
df.Skills.str.get_dummies(sep=",").add_prefix("skills_")
# sütun isimlerine ekleme yaptık. nerden geldiğini daha iyi anlamak için

,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React
0,0,0,0,0,0,0,0,0
1,1,1,0,0,0,0,1,0
2,0,0,0,0,0,0,0,0
3,0,0,1,0,1,1,0,0
4,0,0,0,1,0,0,0,1

In [278]:
skills_dummy = df.Skills.str.get_dummies(sep=",").add_prefix("skills_")

In [279]:
df_final = df[["dept", "job", "sales", "Skills"]]
df_final

  dept                 job     sales                Skills
0   HR             manager  180000.0
1   IT        data analyst  150000.0  Python, Tableau, SQL
2   HR           recruiter  120000.0
3   IT      data scientist  170000.0             ML,DL,NLP
4   IT  frontend developer  120000.0          React,Django

In [280]:
df_final2 = df_final.join(skills_dummy)
df_final2

,dept,job,sales,Skills,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React
0,HR,manager,180000.0,,0,0,0,0,0,0,0,0
1,IT,data analyst,150000.0,"Python, Tableau, SQL",1,1,0,0,0,0,1,0
2,HR,recruiter,120000.0,,0,0,0,0,0,0,0,0
3,IT,data scientist,170000.0,"ML,DL,NLP",0,0,1,0,1,1,0,0
4,IT,frontend developer,120000.0,"React,Django",0,0,0,1,0,0,0,1

In [281]:
df_final2.drop("Skills", axis=1, inplace=True)

In [282]:
df_final2

,dept,job,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React
0,HR,manager,180000.0,0,0,0,0,0,0,0,0
1,IT,data analyst,150000.0,1,1,0,0,0,0,1,0
2,HR,recruiter,120000.0,0,0,0,0,0,0,0,0
3,IT,data scientist,170000.0,0,0,1,0,1,1,0,0
4,IT,frontend developer,120000.0,0,0,0,1,0,0,0,1

In [283]:
pd.get_dummies(df_final2, drop_first=True)

,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React,dept_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,180000.0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,150000.0,1,1,0,0,0,0,1,0,1,0,0,0,0
2,120000.0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,170000.0,0,0,1,0,1,1,0,0,1,1,0,0,0
4,120000.0,0,0,0,1,0,0,0,1,1,0,1,0,0

In [284]:
df_final3 = pd.get_dummies(df_final2, drop_first=True)
df_final3

,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React,dept_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,180000.0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,150000.0,1,1,0,0,0,0,1,0,1,0,0,0,0
2,120000.0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,170000.0,0,0,1,0,1,1,0,0,1,1,0,0,0
4,120000.0,0,0,0,1,0,0,0,1,1,0,1,0,0

# DataFrame Import and Export

In [285]:
df_final3

,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React,dept_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,180000.0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,150000.0,1,1,0,0,0,0,1,0,1,0,0,0,0
2,120000.0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,170000.0,0,0,1,0,1,1,0,0,1,1,0,0,0
4,120000.0,0,0,0,1,0,0,0,1,1,0,1,0,0

In [286]:
df_final3.to_csv("df_final3.csv")

In [287]:
pd.read_csv("df_final3.csv") # ekstra index ekledi

,Unnamed: 0,sales,skills_ SQL,skills_ Tableau,skills_DL,skills_Django,skills_ML,skills_NLP,skills_Python,skills_React,dept_IT,job_data scientist,job_frontend developer,job_manager,job_recruiter
0,0,180000.0,0,0,0,0,0,0,0,0,0,0,0,1,0
1,1,150000.0,1,1,0,0,0,0,1,0,1,0,0,0,0
2,2,120000.0,0,0,0,0,0,0,0,0,0,0,0,0,1
3,3,170000.0,0,0,1,0,1,1,0,0,1,1,0,0,0
4,4,120000.0,0,0,0,1,0,0,0,1,1,0,1,0,0

In [288]:
# pd.read_csv("df_final3.csv", index_col=0) yendiden indexlenemeden kurtulduk

## bir siteden tablo okuma

In [289]:
df = pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)")
df

[                        Country / Area UN continental region[4]  \
 0                             China[a]                     Asia
 1                                India                     Asia
 2                        United States                 Americas
 3                            Indonesia                     Asia
 4                             Pakistan                     Asia
 ..                                 ...                      ...
 232        Montserrat (United Kingdom)                 Americas
 233  Falkland Islands (United Kingdom)                 Americas
 234                               Niue                  Oceania
 235              Tokelau (New Zealand)                  Oceania
 236                              World                      NaN

     UN statistical subregion[4]  Population (1 July 2022)  \
 0                  Eastern Asia                1425887337
 1                 Southern Asia                1417173173
 2              Northern America                 338289857
 3            South-eastern Asia                 275501339
 4                 Southern Asia                 235824863
 ..                          ...                       ...
 232                   Caribbean                      4390
 233               South America                      3780
 234                   Polynesia                      1934
 235                   Polynesia                      1871
 236                         NaN                7975105156

      Population (1 July 2023)  Change
 0                  1425671352  −0.02%
 1                  1428627663  +0.81%
 2                   339996564  +0.50%
 3                   277534123  +0.74%
 4                   240485658  +1.98%
 ..                        ...     ...
 232                      4387  −0.07%
 233                      3791  +0.29%
 234                      1935  +0.05%
 235                      1893  +1.18%
 236                8045311448  +0.88%

 [237 rows x 6 columns],
    .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}vteLists of countries by population statistics  \
 0                                              Global
 1                               Continents/subregions
 2                                    Intercontinental
 3                                  Cities/urban areas
 4                                     Past and future
 5                                  Population density
 6                                   Growth indicators
 7                                     Life expectancy
 8                                  Other demographics
 9                                              Health
 10                           Education and innovation
 11                                           Economic
 12    List of international rankings Lists by country

    .mw-parser-output .navbar{display:inline;font-size:88%;font-weight:normal}.mw-parser-output .navbar-collapse{float:left;text-align:left}.mw-parser-output .navbar-boxtext{word-spacing:0}.mw-parser-output .navbar ul{display:inline-block;white-space:nowrap;line-height:inherit}.mw-parser-output .navbar-brackets::before{margin-right:-0.125em;content:"[ "}.mw-parser-output .navbar-brackets::after{margin-left:-0.125em;content:" ]"}.mw-parser-output .navbar li{word-spacing:-0.125em}.mw-parser-output .navbar a>span,.mw-parser-output .navbar a>abbr{text-decoration:inherit}.mw-parser-output .navbar-mini abbr{font-variant:small-caps;border-bottom:none;text-decoration:none;cursor:inherit}.mw-parser-output .navbar-ct-full{font-size:114%;margin:0 7em}.mw-parser-output .navbar-ct-mini{font-size:114%;margin:0 4em}vteLists of countries by population statistics.1
 0   Current population United Nations Demographics...
 1   Africa Antarctica Asia Europe North America Ca...
 2   Americas Arab world Commonwealth of Nations Eu...
 3   World cities National capitals Megacities Mega...
 4   Past and future population World population es...
 5   Current density Past and future population den...
 6   Population growth rate Natural increase Net re...
 7   world Africa Asia Europe North America South A...
 8   Age at childbearing Age at first marriage Age ...
 9   Antidepressant consumption Antiviral medicatio...
 10  Bloomberg Innovation Index Education Index Int...
 11  Access to financial services Development aid d...
 12    List of international rankings Lists by country                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        ]

In [290]:
table = pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)")
df_country = table[0] # ilk tabloyu almış olduk
df_country

,Country / Area,UN continental region[4],UN statistical subregion[4],Population (1 July 2022),Population (1 July 2023),Change
0,China[a],Asia,Eastern Asia,1425887337,1425671352,−0.02%
1,India,Asia,Southern Asia,1417173173,1428627663,+0.81%
2,United States,Americas,Northern America,338289857,339996564,+0.50%
3,Indonesia,Asia,South-eastern Asia,275501339,277534123,+0.74%
4,Pakistan,Asia,Southern Asia,235824863,240485658,+1.98%
...,...,...,...,...,...,...
232,Montserrat (United Kingdom),Americas,Caribbean,4390,4387,−0.07%
233,Falkland Islands (United Kingdom),Americas,South America,3780,3791,+0.29%
234,Niue,Oceania,Polynesia,1934,1935,+0.05%
235,Tokelau (New Zealand),Oceania,Polynesia,1871,1893,+1.18%
236,World,NaN,NaN,7975105156,8045311448,+0.88%

In [291]:
df = pd.read_csv("time_exercise.csv")
df.head()

   id_product  order_date  product_quantity  product_price  entry_date
0         401  2021-01-23               1.0     541.487603  2018-12-04
1         416  2020-04-02               1.0     131.181818  2018-12-04
2         717  2019-03-10               1.0    2035.488500  2018-12-04
3         778  2019-12-27               1.0     335.988000  2018-12-04
4         826  2020-02-19               1.0     342.292302  2018-12-04

In [292]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 911 entries, 0 to 910
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id_product        911 non-null    int64
 1   order_date        911 non-null    object
 2   product_quantity  911 non-null    float64
 3   product_price     911 non-null    float64
 4   entry_date        911 non-null    object
dtypes: float64(2), int64(1), object(2)
memory usage: 35.7+ KB

In [293]:
df["entry_date"]

0      2018-12-04
1      2018-12-04
2      2018-12-04
3      2018-12-04
4      2018-12-04
          ...
906    2020-10-07
907    2020-10-07
908    2020-11-13
909    2020-11-24
910    2020-11-26
Name: entry_date, Length: 911, dtype: object

In [294]:
pd.to_datetime(df["entry_date"])

0     2018-12-04
1     2018-12-04
2     2018-12-04
3     2018-12-04
4     2018-12-04
         ...
906   2020-10-07
907   2020-10-07
908   2020-11-13
909   2020-11-24
910   2020-11-26
Name: entry_date, Length: 911, dtype: datetime64[ns]

In [295]:
df["entry_date"] = pd.to_datetime(df["entry_date"])
df["order_date"] = pd.to_datetime(df["order_date"])
df.tail()

     id_product order_date  product_quantity  product_price entry_date
906     1536842 2020-11-24               1.0    1186.776860 2020-10-07
907     1536842 2020-11-24               1.0    1186.776860 2020-10-07
908     1536887 2020-11-22               1.0       0.000000 2020-11-13
909     1536952 2021-01-26               1.0     988.429752 2020-11-24
910     1536974 2020-12-06               1.0       0.000000 2020-11-26

In [296]:
df["order_date"]

0     2021-01-23
1     2020-04-02
2     2019-03-10
3     2019-12-27
4     2020-02-19
         ...
906   2020-11-24
907   2020-11-24
908   2020-11-22
909   2021-01-26
910   2020-12-06
Name: order_date, Length: 911, dtype: datetime64[ns]

In [297]:
df["order_date"].dt.to_period("D")

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: period[D]

In [298]:
df.order_date.dt.date

0      2021-01-23
1      2020-04-02
2      2019-03-10
3      2019-12-27
4      2020-02-19
          ...
906    2020-11-24
907    2020-11-24
908    2020-11-22
909    2021-01-26
910    2020-12-06
Name: order_date, Length: 911, dtype: object